20220211153002-horsehoe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-19 Mon 20:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Horsehoe prior</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Horsehoe prior</h1>
<p>
We can define the Horseshoe prior in the general context of a <a href="20220214154550-gaussian_scale_mixture.html#ID-e878015f-6716-44e8-a79b-6b9fa2cbc89b">gaussian scale mixture</a> model :
</p>

\begin{align*}
  z_i &\sim \operatorname{Normal}(x_i^T\beta,\; \sigma^2\, \omega_i^2)\\
  \sigma^2 &\sim \pi(\sigma^2)\, \mathrm{d}\sigma^2\\
  \omega_i &\sim \pi(\omega_i)\, \mathrm{d}\omega_i\\
  \beta_j &\sim \operatorname{Normal}(0,\; \lambda_j^2\, \tau^2\, \sigma^2)\\
 \lambda_{j}  &\sim \operatorname{C}^{+}(0, 1)\\
 \tau &\sim \operatorname{C}^+(0,1)\\
\end{align*}


<p>
It is characterized by the global (\(\tau\)) and local (\(\lambda_j\)) <i>shrinkage parameters</i> that follow a half-Cauchy distribution.
</p>

<div id="outline-container-orgcb183bb" class="outline-2">
<h2 id="orgcb183bb">How does it work?</h2>
</div>


<div id="outline-container-org507fb55" class="outline-2">
<h2 id="org507fb55">Sampling</h2>
<div class="outline-text-2" id="text-org507fb55">
<p>
We can use the fact that the <a href="20220214161724-half_cauchy_distribution.html#ID-45ccc897-f07c-4adc-9142-9ae8870fbddc">Half-Cauchy distribution</a> can be written as the mixture of two <a href="20220214163601-inverse_gamma_distribution.html#ID-61967eb9-6a01-4d0c-a1e9-de25f68f5f4a">inverse-gamma distribution</a>s to write the conditional posterior distributions for the local shrinkage parameters.
</p>
</div>
</div>

<div id="outline-container-orge99a829" class="outline-2">
<h2 id="orge99a829">Links to this note</h2>
</div>
</div>
</body>
</html>